 ** Create a DataFrama using Lists **

- list == dicta
- dict ==list

$ Step -1 $

Create DataFrame

In [9]:
import pandas as pd

$ step -2 $
Provide the Data

In [10]:
names=['Ayush','Avinash','Akash']
# df=pd.DataFrame(names) 
   #Or
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [16]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
salary=[10000,12000,32000]
df=pd.DataFrame(zip(names,age,salary),columns=['names','age','salary'])
df

     names  age  salary
0    Ayush   25   10000
1  Avinash   30   12000
2    Akash   35   32000

In [18]:

dic = {'names': ['akhil', 'arivand','aditya'], 'age': [31,29,43 ]}
df = pd.DataFrame(data=dic)
df

     names  age
0    akhil   31
1  arivand   29
2   aditya   43

In [13]:
pd.core.frame.DataFrame

pandas.core.frame.DataFrame

$ step- 4 $

- if you want to add new column
- First you need to check 

- For example in above

- that list equate to the dataframe

In [19]:
jobs=['Data Scientist','Cyber Security','AI engineer']
married=['Yes','Yes','No']
df['JOB']=jobs
df

     names  age             JOB
0    akhil   31  Data Scientist
1  arivand   29  Cyber Security
2   aditya   43     AI engineer

In [20]:
df['JOB']=['Data Scientist','Prompt Engineer','Ai engineer']

In [ ]:
df

$ step - 6 $

** Change the Index **

In [21]:
indx=['A','B','C']
df=pd.DataFrame(data=zip(names,age,salary),index=indx,columns=['Names','Age','Salary'])
df
df['JOB']=['Data Scientist','Prompt Engineer','Ai engineer']

In [22]:
df

     Names  Age  Salary              JOB
A    Ayush   25   10000   Data Scientist
B  Avinash   30   12000  Prompt Engineer
C    Akash   35   32000      Ai engineer

**Note**
- Number of list equals to number of rows
- Number of values inside list equals to **number of rows**
- when you create the data all the lists will be in same length

$ step - 7 $

**shape**
- Number of rows

- Number of columns

In [23]:
df.shape
print("Number of rows are:",df.shape[0])
print("Number of columns are:",df.shape[1])

Number of rows are: 3
Number of columns are: 4

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   3 non-null      object
 1   Age     3 non-null      int64
 2   Salary  3 non-null      int64
 3   JOB     3 non-null      object
dtypes: int64(2), object(2)
memory usage: 120.0+ bytes

$ step - 8 $
 
**Drop the columns**

- In order to drop column we required 3 arguments

- column name
    - the column name we need to mention
 
- axis

    - axis = 0 (**represents rows**)
    - axis = 1 (**represents columns**)

- inplace 
    - we are drop column menas we are modifying the data frame 
    - so this modification we want to save in same variable or different variable
    - If you want to keep in the same variable the **inplace=True**

In [25]:
df1=df.drop('Age',axis=1,inplace=False)

In [26]:
df

     Names  Age  Salary              JOB
A    Ayush   25   10000   Data Scientist
B  Avinash   30   12000  Prompt Engineer
C    Akash   35   32000      Ai engineer

In [27]:
df1

     Names  Salary              JOB
A    Ayush   10000   Data Scientist
B  Avinash   12000  Prompt Engineer
C    Akash   32000      Ai engineer

$step -9$

**Multiple Columns**

- again reading the data

In [28]:
df.drop(['JOB','Salary'],axis=1)

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35

In [ ]:
df

$step-10$

**Drop Rows**

In [29]:
df.drop('A',axis=0)

     Names  Age  Salary              JOB
B  Avinash   30   12000  Prompt Engineer
C    Akash   35   32000      Ai engineer

$step-11$

**How to save the data Frame**

- generally dataframes are two types 1)CSV and 2)Excel

In [30]:
df

     Names  Age  Salary              JOB
A    Ayush   25   10000   Data Scientist
B  Avinash   30   12000  Prompt Engineer
C    Akash   35   32000      Ai engineer

In [31]:
# file name =data
# Extension=.csv
df.to_csv('data.csv')

df.to_csv('data1.csv',index=False)

In [32]:
df.to_excel('data_exl.xlsx',index=False)

In [1]:
print('github sample')

github sample